Enums/ТаймфреймыСвечей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТаймфреймыСвечей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>_1Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_5Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_15Min</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_1Hour</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_Day</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>_Week</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТаймфреймыСвечей/Ext/ManagerModule.bsl
Функция ПолучитьИнтервалСвечейAPI(Таймфрейм) Экспорт
    
    // Подстрой под своё перечисление ТаймфреймыСвечей.
    
    Если Таймфрейм = Перечисления.ТаймфреймыСвечей._Week Тогда
        Возврат "CANDLE_INTERVAL_WEEK";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._Day Тогда
        Возврат "CANDLE_INTERVAL_DAY";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._1Hour Тогда
        Возврат "CANDLE_INTERVAL_HOUR";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._15Min Тогда
        Возврат "CANDLE_INTERVAL_15_MIN";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._5Min Тогда
        Возврат "CANDLE_INTERVAL_5_MIN";
    ИначеЕсли Таймфрейм = Перечисления.ТаймфреймыСвечей._1Min Тогда
        Возврат "CANDLE_INTERVAL_1_MIN";
    КонецЕсли;
    
    ВызватьИсключение "Неизвестный таймфрейм: " + Строка(Таймфрейм);
    
КонецФункции
